      

def arAnalisi(intx):
  onoma = {}
  #μονάδα,δεκάδα,εκατοντάδα,χιλιάδα,δεκάδα χιλιάδες, εκατοντάδα χιλιάδες (6 θηλυκά)
  #εκατομμύριο (ουδέτερο)
  
  genos = ['Θηλυκό']*6
  genos.append('Ουδέτερο')
  onoma[0] = ['Μονάδα','Μονάδες']
  onoma[1] = ['Δεκάδα','Δεκάδες']
  onoma[2] = ['Εκατοντάδα','Εκατοντάδες']
  onoma[3] = ['Χιλιάδα','Χιλιάδες']
  onoma[4] = ['Δεκάδα χιλιάδες','Δεκάδες χιλιάδες']
  onoma[5] = ['Εκατοντάδα χιλιάδες','Εκατοντάδες χιλιάδες']
  onoma[6] = ['Εκατομμύριο','Εκατομμύρια']

  analisi = ''
  psifioOn = {'Θηλυκό':['Μηδέν','Μία','Δύο','Τρεις','Τέσσερις','Πέντε','Έξι','Εφτά',
    'Οχτώ','Εννιά'],
    'Αρσενικό':['Μηδέν','Ένας','Δύο','Τρεις','Τέσσερις','Πέντε','Έξι','Εφτά',
    'Οχτώ','Έννιά'],
    'Ουδέτερο':['Μηδέν','Ένα','Δύο','Τρία','Τέσσερα','Πέντε','Έξι','Εφτά',
    'Οχτώ','Έννιά']}
  if intx < 1 or intx >= 1e7:
    return(None)
  else:
    for b in range(6,-1,-1):
      dinami = 10**b
      if intx >= dinami:
        psifio = intx//dinami
        analisi += psifioOn[genos[b]][psifio]
        analisi += ' '
        analisi += onoma[b][psifio>1]
        analisi += ' '
        intx -= psifio*dinami
    return(analisi)
      
    
x = input('Δώσε αριθμό:')
x = float(x)
intx = int(x)
print(arAnalisi(intx))
